
*** Task 14
We're almost ready to draw the heat map. We're going to be using Matplotlib's ~pcolormesh()~ function.

Right now, ~abs_distances~ is a list of ~10000~ numbers. ~pcolormesh~ needs a two dimensional list. We need to turn ~abs_distances~ into a 100 by 100 two dimensional array.

Numpy's ~reshape~ function does this for us. The code below turns list ~lst~ into a 2 by 2 list.

#+begin_src python :results output
  import numpy as np

  lst = [1, 2, 3, 4]
  new_lst = np.reshape(lst, (2, 2))
  print(new_lst)
#+end_src

#+RESULTS:
: [[1 2]
:  [3 4]]

Turn ~abs_distances~ into a 100 by 100 list and name it ~distances_matrix~.

** Script.py

#+begin_src python :results output
  import seaborn as sns
  from sklearn.linear_model import Perceptron
  import matplotlib.pyplot as plt
  import numpy as np
  from itertools import product

  # Inputs to AND
  data = [[0, 0], [0, 1], [1, 0], [1, 1]]

  # Labels for AND
  labels = [0, 0, 0, 1]

  plt.scatter([point[0] for point in data], [point[1] for point in data], c=labels)

  plt.show()

  classifier = Perceptron(max_iter=40, random_state=22)

  classifier.fit(data, labels)
  print(classifier.score(data, labels))

  print(classifier.decision_function([[0, 0], [1, 1], [0.5, 0.5]]))

  x_values = np.linspace(0, 1, 100)
  y_values = np.linspace(0, 1, 100)

  point_grid = list(product(x_values, y_values))

  distances = classifier.decision_function(point_grid)

  abs_distances = [abs(pt) for pt in distances]

  distances_matrix = np.reshape(abs_distances, (100, 100))

  heatmap = plt.pcolormesh(x_values, y_values, distances_matrix)

  plt.colorbar(heatmap)

  plt.show()

#+end_src

#+RESULTS:
: 1.0
: [-4.   1.  -1.5]
